## Week 1

### Syntax to create a table

create table TABLENAME (
    COLUMN1 datatype,
    COLUMN2 datatype,
    COLUMN3 datatype,
    );

# creating a table in SQL

create table COUNTRY (
    ID int,
    CCODE char(2),
    NAME varchar(60)
);

# additional keywords
# varchar is variable length and char is fixed length
# in char, any remaining space is padded with blanks

create table COUNTRY (
    ID int NOT NULL,
    CCODE char(2),
    NAME varchar(60),
    PRIMARY KEY (ID)
);

If a table you're trying to create already exists in database, then you will get an error. To go around this, change the name of your table or drop it from the database.

### SELECT Statement

SELECT statement is used to read and modify data. The statement is a Query which outputs a result set/table.

-> select * from tablename;
-> select <column 1>, <column 2> from tablename;

WHERE clause helps to restrict the result set
can use different comparison operators


-> select ID, CCODE from COUNTRY where ID < 5;
OR
-> select ID, CCODE from COUNTRY where CCODE = 'USA';

### COUNT, DISTINCT, LIMIT functions

COUNT is a built-in function that retrieves the number of rows matching the query criteria
-> select COUNT(*) from tablename;

DISTINCT is used to remove duplicate values from a result set

LIMIT is used for restricting the number of rows retrieved from database

### INSERT Statement

Insert statement is used to add new data/rows to the table. values and columns should be equal

INSERT INTO <tablename> (AUTHOR_ID,FNAME,LNAME,EMAIL,CITY,COUNTRY) VALUES('A2801','Aditya', 'Mujumdar','ammujumd@asu.edu','Tempe', 'USA'),('A2809','Jan', 'Doe','djoe@asu.edu','Tempe', 'USA');

### UPDATE & DELETE Statements

###### UPDATE

After data has been added to the created table, it can be changed using UPDATE

Author_id   FNAME   LNAME        EMAIL        CITY  COUNTRY
A2801      Aditya  Mujumdar ammujumd@asu.edu  Tempe   USA


UPDATE <tablename> SET FNAME = 'Jack' LNAME = 'Doe' WHERE AUTHOR_id = A2801;

###### DELETE

Delete one or more rows from the Table. If you don't specify where condition, all the data in the table will be deleted

DELETE FROM <tablename> WHERE AUTHOR_id IN (A2801);

##### Lab 1: Composing and Running basic SQL queries

drop table INSTRUCTOR;
-- create table INSTRUCTOR
create table INSTRUCTOR(
	ins_id int NOT NULL,
	lastname varchar(50) NOT NULL,
	firstname varchar(50) NOT NULL,
	city varchar(20),
	country char(2),
	PRIMARY KEY (ins_id)
);

INSERT INTO INSTRUCTOR (ins_id, lastname, firstname, city, country) VALUES ('1', 'Ahuja', 'Rav', 'Toronto', 'CA');
INSERT INTO INSTRUCTOR (ins_id, lastname, firstname, city, country) VALUES ('2', 'Chong', 'Raul', 'Toronto', 'CA'), ('3', 'Vasudevan','Hima','Chicago','US');

select * from INSTRUCTOR;
select firstname, lastname from INSTRUCTOR where city = 'Toronto';

update INSTRUCTOR set city = 'Markham' where ins_id = 1;
select * from INSTRUCTOR;

delete from INSTRUCTOR where ins_id in 2;

select * from INSTRUCTOR;

select COUNT(*) from INSTRUCTOR;